/**
Реализовать программу “Hello World!” (программа, выводящая на экран слова “Hello Worl” и ожидающая ввода с клавиатуры для завершения работы) 
в виде консольного приложения в среде разработки MS Visual Studio. Внести различные ошибки в программу и изучить реакцию компилятора (среды разработки).
**/
#include <iostream>

int main()
{
    std::cout << "Hello, World!" << std::endl;
}